{
    "resume": "Resume",
    "projects": "Projects",
    "contact": "Contact",
    "button": "Button",
    "pokedex_title": "Pokedex",
    "pokedex_description": "A Simple Pokedex. You can search Pokemons by name and see their details. Api used: pokeapi",
    "pokedex_summary": "For Pokémon trainers of all levels! This database app allows you to search for any Pokémon by name and instantly access their stats, battle data, and other crucial information. Built using PokéAPI, a reliable and free source of comprehensive Pokémon data.",
    "rpg__app_title": "RPG App",
    "rpg__app_description": "A RPG companion app",
    "rpg__app_summary": "An App companion for RPG players / GMs. It contains a Dice Roller, Initiative Tracker, Game Hooks, Loot Generator and NPC Generator. DnD 4th edition compatible.",
    "survivor_title": "Fighter Survivor",
    "survivor_description": "A Vampire Survivor-like game, with fighting game theme",
    "survivor_summary": "A demo of a Vampire Survivor-like game, with fighting game and beat'em up theme. It has two selectable characters, moves to unlock and upgrades.",
    "vet_title": "A landing page for a home-visit veterinarian. ",
    "vet__app_description": "A landing page for a Veterinary",
    "vet__app_summary": "A simple landing page with a description, contact information, and a map where the user can check if the veterinarian serves their region.",
    "puzzle_title": "Zombie Puzzle",
    "puzzle_description": "Protect the apocalypse survivors and guide them to safety, but be quick, or the zombies might catch them.",
    "puzzle_summary": "In this alpha version, players must carefully plan a strategic path on a game board to guide survivors to a safe haven. You'll need to defeat waves of zombies using a card deck that contains routes and zombie traps. This alpha phase includes 5 tutorial stages, each designed to teach a fundamental game mechanic and help the player effectively learn how to play.",
    "platform_title": "Platform game",
    "platform_description": "Control a post-apocalyptic survivor and use your martial arts skills to ensure your survival in this game.",
    "platform_summary": "In this game prototype, your main goal is to explore the ruins of a post-apocalyptic city in search of vital resources for survival. You'll be able to walk, perform karate moves, and jump to defend yourself from enemy zombies. The game includes a tutorial stage and a refuge, where you must protect the location from incessant zombie attacks.",
    "ski_title": "Level Up: an RPG Jam - Ski Game",
    "ski_description": "Inspired by SkiFree, this game offers dynamic character progression, where your direct in-game actions drive development and improvement.",
    "ski_summary": "This project, developed for Level Up: an RPG Jam, is a tribute to SkiFree. In it, you control a skier who must hone their skills by dodging obstacles and defeating enemies. As your character evolves, prepare to face increasing challenges, with the emergence of stronger enemies and new obstacles.",
    "aboutme": "About Me",
    "mysummary": "Passionate Front-end Developer with a proven track record of building responsive, accessible, and high-performance user interfaces. Solid experience in developing for e-commerce and complex web platforms, with expertise in React and Angular. Continuously seeking to enhance my skills and contribute to innovative projects that provide the best user experience.",
    "experience": "Experience",
    "business1_name": "Retroverse",
    "business1_position": "Game Dev",
    "business1_date": "September 2022 - Present",
    "business1_description1": "Actively contributed to the development of game projects, working in both the Unity environment and performing testing. My responsibilities included implementing mechanics, UI, improvements, and identifying and documenting bugs and failures through functional and usability testing.",
    "business1_description2": "Creation of game prototypes.",
    "business1_description3": "Technologies used: Unity, Aseprite, C#.",
    "business2_name": "CONFLUENCE INFORMÁTICA",
    "business2_position": "Front-end Developer",
    "business2_date": "May 2019 - September 2022",
    "business2_description1": "Front-End Development for the Omnilinker Integrations Monitor (Angular).",
    "business2_description2": "Development of other projects using React.",
    "business2_description3": "Technologies used: HTML5, CSS, SASS, Javascript, React, Angular, Styled Components, Bootstrap, Git.",
    "business3_name": "Carrefour Brasil",
    "business3_position": "Front-end Developer",
    "business3_date": "October 2017 - May 2019",
    "business3_description1": "Worked on e-commerce, publishing assets on the main page and categories. Updated showcases and product pages.",
    "business3_description2": "Developed front-end code for landing pages and content hotsites.",
    "business3_description3": "Technologies used: HTML, CSS, Javascript.",
    "business4_name": "Saraiva e Siciliano",
    "business4_position": "Web Designer",
    "business4_date": "September 2010 - October 2017",
    "business4_description1": "Published and updated assets on the website's main page and categories. Created and deployed email marketing.",
    "business4_description2": "Developed front-end for landing pages and content hotsites.",
    "business4_description3": "Technologies used: HTML5, CSS, SASS, Javascript, jQuery, Bootstrap.",
    "education": "Education",
    "education1_school": "Universidade Presbiteriana Mackenzie / Higher Education",
    "education1_course": "Industrial Design",
    "education1_date": "2006",
    "education2_school": "Saga Computação Gráfica",
    "education2_course": "PlayGame / Game Development",
    "education2_date": "2010",
    "education3_school": "Colégio Rainha da Paz",
    "education3_course": "High School",
    "education3_date": "2001",
    "skills": "Skills",
    "lets_work_title": "Let’s work together",
    "lets_work_socials": "You can find me on these social medias below",
    "name": "Name",
    "message": "Type your message here",
    "submit": "Submit",
    "home_text": "Board gamer enthusiastic and frontend by nature. Roll a dice and have fun!",
    "roll_dice": "Roll Dice",
    "summary": "Summary",
    "error": "Page not Found",
    "page": "Page",
    "repository": "Repository",
    "seemore": "See more works"
}