{
    "resume": "Resume",
    "projects": "Projects",
    "contact": "Contact",
    "button": "Button",
    "pokedex_title": "Pokédex",
    "pokedex_description": "A Simple Pokédex. You can search Pokemons by name and see their details. Api used: pokeapi",
    "pokedex_summary": "For Pokémon Trainers of all levels! This database app lets you search any Pokémon by name and instantly access its stats, battle data, and other crucial information. It's built on PokéAPI, a reliable and free source of comprehensive Pokémon data.\n\nI was inspired by the concept of the Pokédex, a fictional device from the series that functions as an encyclopedia and catalog. I've created a search screen where users can look up Pokémon by typing the name. Clicking on a name takes them to a screen displaying simple data for each Pokémon: name, attributes, weight, height, and category.\n\nCredits:\nArt Assets: <pokeOfficial>Official Pokémon Site</pokeOfficial>\nAPI: <pokeApi>PokéAPI</pokeApi>",
    "rpg__app_title": "RPG App",
    "rpg__app_description": "A RPG companion app",
    "rpg__app_summary": "An App companion for RPG players / GMs. It contains a Dice Roller, Initiative Tracker, Game Hooks, Loot Generator and NPC Generator. DnD 4th edition compatible.\n\nI started this application as an exercise to learn Angular and JavaScript/TypeScript. I asked some RPG-playing friends for suggestions on interesting apps to help GMs and players, and I created these five simple applications. To build it, I used the rules and tables from Dungeons & Dragons, specifically the Fourth Edition, as that was the material most readily available to me. For the Game Hooks and Loot Generator sections, I used the links below.\n\nCredits:\nGamehooks - <gamehooks1>\n50 Adventure Hooks To Steal For Your Game</gamehooks1><gamehooks2>\n100 Side Quest Hooks</gamehooks2>\nDungeon Master Tables - <lootGenerator>https://dungeonmastertools.github.io/</lootGenerator>",
    "survivor_title": "Fighter Survivor",
    "survivor_description": "A Vampire Survivor-like game, with fighting game theme",
    "survivor_summary": "A demo of a Vampire Survivor-like game, with fighting game and beat'em up theme. It has two selectable characters, moves to unlock and upgrades.\n\nCredits:\nMusic - \nMagic Fx 7 & cyberpunk-street: <ansimuz>https://ansimuz.itch.io/</ansimuz>\nSprites -\nRobot Warfare Asset Pack 24-11-21: <mattWalkden>https://mattwalkden.itch.io</mattWalkden>\nWhirlwind: <whirlwind>https://opengameart.org/users/spring-spring</whirlwind>\nFireball: <fireball>https://opengameart.org/users/prushik</fireball>\nBattle VFX: <battleVFX>Slashes and Thrusts by https://pimen.itch.io/</battleVFX>",
    "vet_title": "A landing page for a home-visit veterinarian. ",
    "vet__app_description": "A landing page for a Veterinary",
    "vet__app_summary": "A simple landing page with a description, contact information, and a map where the user can check if the veterinarian serves their region.\n\nIt was decided for nextjs for the app because of the simplicity of the project and SEO Optimization.\n\nInitially, we developed the map using React Leaflet. This version enabled clients to visualize the coverage area via a radius and input an address to verify if it was within the service region. However, we opted for a simpler solution, integrating a map from Google My Maps.\n\nCredits:\nReact Leaflet - <reactLeaflet>https://react-leaflet.js.org/</reactLeaflet>\nGoogle My Maps - <myMaps>https://www.google.com/intl/pt-BR/maps/about/mymaps/</myMaps>",
    "puzzle_title": "Zombie Puzzle",
    "puzzle_description": "Protect the apocalypse survivors and guide them to safety, but be quick, or the zombies might catch them.",
    "puzzle_summary": "In this alpha version, players must carefully plan a strategic path on a board to guide survivors to a safe house. You'll need to defeat waves of zombies using a deck of cards that contains routes and traps. This alpha phase includes 5 tutorial stages, each designed to teach a fundamental game mechanic and help players learn to play effectively.\n\nWhen developing this game, our objective was to think a variation of deck building. Thus, we combined the mechanics of games like Pipe Dream (where you create a path with cards) and Tower Defense, resulting in a system where you not only build the path to the shelter but also set up defenses against the zombies along that route.\n\nCredits:\n\nProgramming -\nEduardo Issamu Nakamura: <einGit>Github</einGit>\nHugo Sakai:  <hsGit>Github</hsGit>\nHumberto Meale:  <hmGit>Github</hmGit>\n\nAssets - \nMusics: <creativeCommons>Kevin MacLeod</creativeCommons>\nSounds: <zapSplat>Zapsplat</zapSplat>\n3D: <syntyStudios>Synty Studios</syntyStudios>\nIcons: <kenneyGameAssets>Kenney Game Assets All-in-1</kenneyGameAssets>\n",
    "platform_title": "Platform game",
    "platform_description": "Control a post-apocalyptic survivor and use your martial arts skills to ensure your survival in this game.",
    "platform_summary": "In this game prototype, your main goal is to explore the ruins of a post-apocalyptic city in search of vital resources for survival. You'll be able to walk, perform karate moves, and jump to defend yourself from enemy zombies. The game includes a tutorial stage and a refuge, where you must protect the location from incessant zombie attacks.\n\nThis prototype was the second made on Unity. I made this demo based on platform games of the 8/16 bits era. Besides programming, i made the sprites of the main character and the enemies, inspired in the series <sdHiryuu>Hiryu no Ken</sdHiryuu> and <kunioKun>Kunio-kun</kunioKun>. I used the Corgi Engine from MoreMountains, a Unity 2D + 2.5D Platformer Games Kit.\n\nCredits: \nBackgrounds: <actionCity>Free - Action Pack - CITY</actionCity> \nCorgi Engine: <corgiEngine>More Mountains</corgiEngine> ",
    "ski_title": "Level Up: an RPG Jam - Ski Game",
    "ski_description": "Inspired by SkiFree, this game offers dynamic character progression, where your direct in-game actions drive development and improvement.",
    "ski_summary": "This project, developed for <gameJam>Level Up: an RPG Jam</gameJam>, is a tribute to SkiFree. In it, you control a skier who must hone their skills by dodging obstacles and defeating enemies. As your character evolves, prepare to face increasing challenges, with the emergence of stronger enemies and new obstacles.\n\nThe theme of the Game Jam was an RPG with 7 attributes: strength, speed, agility, defense, attack, morale, and discipline. Each attribute could be improved based on the player's actions. A package with the attribute and level-up mechanics was provided for use in the project, and the rest of the mechanics were built on top of this package. The deadline was 4 weeks, but I was unable to finish the project in time for submission. However, I still released this functional prototype, though it is not balanced.\n\nCredits:\nTiny Ski Sprites - <kenneyGameAssets>Kenney Game Assets All-in-1</kenneyGameAssets>\nLevel Up - An RPG Jam - <gameJam>https://itch.io/jam/level-up-rpg-jam</gameJam>",
    "aboutme": "About Me",
    "mysummary": "Passionate Front-end Developer with a proven track record of building responsive, accessible, and high-performance user interfaces. Solid experience in developing for e-commerce and complex web platforms, with expertise in React and Angular. Continuously seeking to enhance my skills and contribute to innovative projects that provide the best user experience.",
    "experience": "Experience",
    "business1_name": "Retroverse",
    "business1_position": "Game Dev",
    "business1_date": "September 2022 - Present",
    "business1_description1": "Actively contributed to the development of game projects, working in both the Unity environment and performing testing. My responsibilities included implementing mechanics, UI, improvements, and identifying and documenting bugs and failures through functional and usability testing.",
    "business1_description2": "Creation of game prototypes.",
    "business1_description3": "Technologies used: Unity, Aseprite, C#.",
    "business2_name": "CONFLUENCE INFORMÁTICA",
    "business2_position": "Front-end Developer",
    "business2_date": "May 2019 - September 2022",
    "business2_description1": "Front-End Development for the Omnilinker Integrations Monitor (Angular).",
    "business2_description2": "Development of other projects using React.",
    "business2_description3": "Technologies used: HTML5, CSS, SASS, Javascript, React, Angular, Styled Components, Bootstrap, Git.",
    "business3_name": "Carrefour Brasil",
    "business3_position": "Front-end Developer",
    "business3_date": "October 2017 - May 2019",
    "business3_description1": "Worked on e-commerce, publishing assets on the main page and categories. Updated showcases and product pages.",
    "business3_description2": "Developed front-end code for landing pages and content hotsites.",
    "business3_description3": "Technologies used: HTML, CSS, Javascript.",
    "business4_name": "Saraiva e Siciliano",
    "business4_position": "Web Designer",
    "business4_date": "September 2010 - October 2017",
    "business4_description1": "Published and updated assets on the website's main page and categories. Created and deployed email marketing.",
    "business4_description2": "Developed front-end for landing pages and content hotsites.",
    "business4_description3": "Technologies used: HTML5, CSS, SASS, Javascript, jQuery, Bootstrap.",
    "education": "Education",
    "education1_school": "Universidade Presbiteriana Mackenzie / Higher Education",
    "education1_course": "Industrial Design",
    "education1_date": "2006",
    "education2_school": "Saga Computação Gráfica",
    "education2_course": "PlayGame / Game Development",
    "education2_date": "2010",
    "education3_school": "Colégio Rainha da Paz",
    "education3_course": "High School",
    "education3_date": "2001",
    "skills": "Skills",
    "lets_work_title": "Let’s work together",
    "lets_work_socials": "You can find me on these social medias below",
    "name": "Name",
    "message": "Type your message here",
    "submit": "Submit",
    "home_text": "Board gamer enthusiastic and frontend by nature. Roll a dice and have fun!",
    "roll_dice": "Roll Dice",
    "summary": "Summary",
    "error": "Page not Found",
    "page": "Page",
    "repository": "Repository",
    "seemore": "See more works",
    "all": "All",
    "react": "React",
    "angular": "Angular",
    "html": "Html",
    "css": "CSS",
    "scss": "SCSS",
    "typescript": "Typescript",
    "javascript": "Javascript",
    "unity": "Unity",
    "csharp": "C#",
    "nextjs": "Next.js",
    "ai": "Artificial intelligence"
}