{
    "resume": "Sobre",
    "projects": "Projetos",
    "contact": "Contatos",
    "button": "Botão",
    "pokedex_title": "Agenda Pokemon",
    "pokedex_description": "Uma Pokédex Simples, com pesquisa e detalhes.",
    "pokedex_summary": "Para Treinadores Pokémon de todos os níveis! Este aplicativo de banco de dados permite pesquisar qualquer Pokémon pelo nome e acessar instantaneamente suas estatísticas, dados de batalha e outras informações cruciais. Construído com base na PokéAPI, uma fonte confiável e gratuita de dados abrangentes sobre Pokémon.\n\nInspirei-me no conceito da Pokéagenda, um dispositivo fictício da série que funciona como uma enciclopédia e catálogo. Foi criada uma tela de pesquisa onde o usuário pode pesquisar o Pokémon pelo nome e, ao clicar, é enviado para uma tela com dados simples de cada Pokémon: nome, atributos, peso, altura e categoria.\n\nCréditos:\nArtes: <pokeOfficial>Official Pokémon Site</pokeOfficial>\nAPI: <pokeApi>PokéAPI</pokeApi>",
    "rpg__app_title": "Aplicativo RPG",
    "rpg__app_description": "Um aplicativo simples de RPG.",
    "rpg__app_summary": "Um aplicativo com ferramentas para jogadores/mestres de rpg. Possui rolagem de dados, marcador de iniciativa, game hooks, gerador de tesouro e gerador de NPCs. Compativel com DnD 4a Edição.\n\nEu comecei este aplicativo como um exercício para aprender Angular e JavaScript/TypeScript. Perguntei a alguns amigos RPGistas sugestões de aplicativos interessantes para ajudar GMs e jogadores, e criei estes cinco aplicativos simples. Para criá-lo, usei as regras e tabelas de Dungeons & Dragons, a Quarta Edição mais especificamente, pois era o material que eu tinha mais facilmente à disposição. Para as partes de Game Hooks e Loot Generator, usei os links abaixo.\n\nCréditos:\nGamehooks - <gamehooks1>\n50 Adventure Hooks To Steal For Your Game</gamehooks1><gamehooks2>\n100 Side Quest Hooks</gamehooks2>\nDungeon Master Tables - <lootGenerator>https://dungeonmastertools.github.io/</lootGenerator>",
    "survivor_title": "Fighter Survivor",
    "survivor_description": "Tipo Vampire Survivor, só que com temática de jogos de luta.",
    "survivor_summary": "Um demo de um jogo no estilo Vampire Survivor, com tema de jogos de luta / Beat em Ups. Possui dois personagens jogáveis, golpes para destravar e upgrades.\n\nCréditos:\nMúsica - \nMagic Fx 7 & cyberpunk-street: <ansimuz>https://ansimuz.itch.io/</ansimuz>\nSprites -\nRobot Warfare Asset Pack 24-11-21: <mattWalkden>https://mattwalkden.itch.io</mattWalkden>\nWhirlwind:  <whirlwind>https://opengameart.org/users/spring-spring</whirlwind>\nFireball:  <fireball>https://opengameart.org/users/prushik</fireball>\nBattle VFX: <battleVFX>Slashes and Thrusts by https://pimen.itch.io/</battleVFX>",
    "vet_title": "Landing Page Veterinário",
    "vet__app_description": "Uma landing page para um veterinário a domicílio.",
    "vet__app_summary": "Este projeto é uma landing page simples, contendo a descrição dos serviços, informações de contato e um mapa que permite ao usuário verificar a área de atendimento do veterinário.\n\nFoi decidido usar nextjs para a aplicação pela simplicidade do projeto e pela otimização de SEO.\n\nInicialmente, desenvolvemos o mapa utilizando React Leaflet. Nesta versão, era possível visualizar a área de cobertura por um raio e o cliente podia inserir um endereço para verificar se estava dentro da região atendida. No entanto, optamos por uma solução mais simples, integrando um mapa do Google My Maps.\n\nCréditos:\nReact Leaflet - <reactLeaflet>https://react-leaflet.js.org/</reactLeaflet>\nGoogle My Maps - <myMaps>https://www.google.com/intl/pt-BR/maps/about/mymaps/</myMaps>",
    "puzzle_title": "Zombie Puzzle",
    "puzzle_description": "Proteja os sobreviventes do apocalipse e guie-os para um lugar seguro, mas seja rápido, ou os zumbis podem alcançá-los.",
    "puzzle_summary": "Nesta versão alfa, os jogadores devem planejar cuidadosamente um trajeto estratégico em um tabuleiro para guiar os sobreviventes até um refúgio seguro. Você precisará derrotar ondas de zumbis usando um deck de cartas que contém rotas e armadilhas. Esta fase alfa inclui 5 estágios tutoriais, cada um projetado para ensinar uma mecânica de jogo fundamental e ajudar o jogador a aprender a jogar de forma eficaz.\n\nAo desenvolver este jogo, nossa intenção era explorar uma variação de deck building. Assim, unimos a mecânica de jogos como Pipe Dream (onde se cria um caminho com cartas) e Tower Defense, resultando em um sistema onde você não só constrói o caminho para o abrigo, mas também monta a defesa contra os zumbis ao longo desse trajeto.\n\nCréditos:\n\nProgramação -\nEduardo Issamu Nakamura: <einGit>Github</einGit>\nHugo Sakai:  <hsGit>Github</hsGit>\nHumberto Meale:  <hmGit>Github</hmGit>\n\nAssets - \nMúsicas: <creativeCommons>Kevin MacLeod</creativeCommons>\nSons: <zapSplat>Zapsplat</zapSplat>\n3D: <syntyStudios>Synty Studios</syntyStudios>\nÍcones: <kenneyGameAssets>Kenney Game Assets All-in-1</kenneyGameAssets>\n",
    "platform_title": "Jogo de Plataforma",
    "platform_description": "Controle um sobrevivente no pós-apocalipse e utilize suas habilidades em artes marciais para garantir sua sobrevivência neste jogo.",
    "platform_summary": "Neste protótipo de jogo, seu objetivo principal é explorar as ruínas de uma cidade pós-apocalíptica em busca de recursos vitais para a sobrevivência. Você poderá andar, executar golpes de karatê e pular para se defender de zumbis inimigos. O jogo inclui um estágio de tutorial e um refúgio, onde você deve proteger o local dos ataques incessantes dos zumbis.\n\nEsse protótipo foi o segundo feito no Unity. Fiz essa demo baseado em jogos de plataforma da era 8/16 bits (Kunio-kun, Castlevania, Hokuto no Ken, Splatterhouse... ). Além da programação, eu fiz as sprites do protagonista e dos inimigos, inspirado nas séries <sdHiryuu>Hiryu no Ken</sdHiryuu> e <kunioKun>Kunio-kun</kunioKun>. Usei o Corgi Engine da More Mountains, um kit para produzir jogos de plataformas no Unity.\n\nCréditos: \nBackgrounds: <actionCity>Free - Action Pack - CITY</actionCity> \nCorgi Engine: <corgiEngine>More Mountains</corgiEngine> ",
    "ski_title": "Level Up Game Jam",
    "ski_description": "Inspirado no skifree, este jogo oferece uma progressão dinâmica do personagem, onde suas ações diretas no gameplay impulsionam o desenvolvimento e aprimoramento.",
    "ski_summary": "Este projeto, desenvolvido para a <gameJam>Level Up: an RPG Jam</gameJam>, é uma homenagem a SkiFree. Nele, você controla um esquiador que deve aprimorar suas habilidades desviando de obstáculos e derrotando inimigos. Conforme seu personagem evolui, prepare-se para enfrentar desafios crescentes, com o surgimento de inimigos mais fortes e novos obstáculos.\n\nO tema da Game Jam era um tema de RPG com 7 atributos: Força, Velocidade, Defesa, Ataque, Moral e Disciplina, e cada atributo pode ser melhorado de acordo com as ações do jogador. Foi disponibilizado um pacote com a mecânica de atributos e level up para poder usar no projeto, e o resto das mecânicas foi feito em cima desse pacote. O prazo de entrega foi 4 semanas, mas não consegui terminar o projeto a tempo da entrega, mas ainda assim disponibilizei esse protótipo funcional, mas não está balanceado.\n\nCréditos\nTiny Ski Sprites - <kenneyGameAssets>Kenney Game Assets All-in-1</kenneyGameAssets>\nLevel Up - An RPG Jam - <gameJam>https://itch.io/jam/level-up-rpg-jam</gameJam>",
    "aboutme": "Sobre",
    "mysummary": "Desenvolvedor Front-end apaixonado por criar interfaces de usuário responsivas, acessíveis e de alta performance. Possuo sólida experiência em desenvolvimento para e-commerce e plataformas web complexas, com expertise em React e Angular. Busco constantemente aprimorar minhas habilidades e contribuir para projetos inovadores que proporcionem a melhor experiência para o usuário.",
    "experience": "Experiência",
    "business1_name": "Retroverse",
    "business1_position": "Game Dev",
    "business1_date": "Setembro de 2022 - Presente",
    "business1_description1": "Contribuí ativamente no desenvolvimento de projetos de jogos, atuando tanto no ambiente Unity quanto na execução de testes. Minhas responsabilidades incluíram implementação de mecânicas, UI, melhorias e a identificação e documentação de bugs e falhas através de testes funcionais e de usabilidade.",
    "business1_description2": "Criação de protótipos de jogos.",
    "business1_description3": "Tecnologias utilizadas: Unity, Aseprite, C#.",
    "business2_name": "Confluence Informática",
    "business2_position": "Desenvolvedor de front-end",
    "business2_date": "Maio de 2019 - Setembro de 2022",
    "business2_description1": "Desenvolvimento Front-End para o Monitor de Integrações Omnilinker (Angular).",
    "business2_description2": "Desenvolvimento de outros projetos utilizando React.",
    "business2_description3": "Tecnologias utilizadas: HTML5, CSS, SASS, Javascript, React, Angular, Styled Components, Bootstrap, Git.",
    "business3_name": "Carrefour Brasil",
    "business3_position": "Desenvolvedor de front-end",
    "business3_date": "Outubro de 2017 - Maio de 2019",
    "business3_description1": "Atuação no e-commerce, realizando a publicação de peças na página principal e categorias. Atualização de vitrines e páginas de produto.",
    "business3_description2": "Desenvolvimento do código front-end de landing pages e hotsites de conteúdo.",
    "business3_description3": "Tecnologias utilizadas: HTML, CSS, Javascript.",
    "business4_name": "Saraiva e Siciliano",
    "business4_position": "Web Designer",
    "business4_date": "Setembro de 2010 - Outubro de 2017",
    "business4_description1": "Publicação e atualização de peças na página principal e categorias do site. Montagem de e-mail marketing.",
    "business4_description2": "Desenvolvimento front-end de landing pages e hotsites de conteúdo.",
    "business4_description3": "Tecnologias utilizadas: HTML5, CSS, SASS, Javascript, jQuery, Bootstrap.",
    "education": "Formação",
    "education1_school": "Universidade Presbiteriana Mackenzie / Ensino Superior",
    "education1_course": "Desenho Industrial",
    "education1_date": "2006",
    "education2_school": "Saga Computação Gráfica",
    "education2_course": "PlayGame / Game Development",
    "education2_date": "2010",
    "education3_school": "Colégio Rainha da Paz",
    "education3_course": "Ensino Médio",
    "education3_date": "2001",
    "skills": "Conhecimentos",
    "lets_work_title": "Vamos trabalhar juntos",
    "lets_work_socials": "Você pode me encontrar nestas redes sociais abaixo.",
    "name": "Nome",
    "message": "Escreva sua mensagem aqui",
    "submit": "Enviar",
    "home_text": "Fanático por jogos de tabuleiro e frontend por natureza. Role o dado e divirta-se!",
    "roll_dice": "Rolar Dado",
    "summary": "Sumário",
    "error": "Page not Found",
    "page": "Pagina",
    "repository": "Repositório",
    "seemore": "Veja mais",
    "all": "Todos",
    "react": "React",
    "angular": "Angular",
    "html": "Html",
    "css": "CSS",
    "scss": "SCSS",
    "typescript": "Typescript",
    "javascript": "Javascript",
    "unity": "Unity",
    "csharp": "C#",
    "nextjs": "Next.js",
    "ai": "Inteligência artificial"
}